Revit 2027 API
RevitLinkOptions(RevitLinkOptions) Constructor
 Constructs a new copy of the input RevitLinkOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RevitLinkOptions(
	RevitLinkOptions other
)
Public Sub New (
	other As RevitLinkOptions
)
public:
RevitLinkOptions(
	RevitLinkOptions^ other
)
new :
        other : RevitLinkOptions -> RevitLinkOptions
Parameters
other RevitLinkOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevitLinkOptions Class
RevitLinkOptions Overload
Autodesk.Revit.DB Namespace